app/views/flights/_new_seat.html.erb


  <%= form.collection_select(:seat_class_id, SeatClass.all, :id, :class_name) %>
---
SELECT "seat_classes".* FROM "seat_classes"