app/controllers/seats_controller.rb

  def index
    @seats = Seat.all
---
SELECT "seats".* FROM "seats"

  def create
    @seat = Seat.new(seat_params)

    respond_to do |format|
      if @seat.save
---
INSERT INTO "seats" ("flight_id", "name", "baggage", "created_at", "updated_at", "seat_class_id") VALUES (?, ?, ?, ?, ?, ?)  [["flight_id", 3], ["name", "Agatta"], ["baggage", 60.0], ["created_at", "2019-06-11 10:27:20.750321"], ["updated_at", "2019-06-11 10:27:20.750321"], ["seat_class_id", 1]]

    def set_seat
      @seat = Seat.find(params[:id])
---
SELECT  "seats".* FROM "seats" WHERE "seats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]