app/controllers/seat_classes_controller.rb

  def index
    @seat_classes = SeatClass.all
---
SELECT "seat_classes".* FROM "seat_classes"

  def create
    @seat_class = SeatClass.new(seat_class_params)

    respond_to do |format|
      if @seat_class.save
---
INSERT INTO "seat_classes" ("class_name", "price", "food_service", "seat_type", "leg_room", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_seat_class
      @seat_class = SeatClass.find(params[:id])
---
SELECT  "seat_classes".* FROM "seat_classes" WHERE "seat_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]