app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["username", "123"], ["password", "123"], ["created_at", "2019-06-11 09:25:33.183331"], ["updated_at", "2019-06-11 09:25:33.183331"]]
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save